Gr5304/app/controllers/productos_controller.rb

  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("name", "tipo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "gaseosa"], ["tipo", "bebida"], ["created_at", "2018-07-26 15:23:32.423952"], ["updated_at", "2018-07-26 15:23:32.423952"]]

    def set_producto
      @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]